In [87]:
import pandas as pd
import difflib

In [6]:
#### Built-up areas
builtupAreas = pd.read_csv('./location-data/builtup-areas.csv')

In [7]:
builtupAreas.head()

     BUA11CD          BUA11NM  FID
0  E34000001            Kexby    1
1  E34000002  Bradfield Heath    2
2  E34000003          Huntley    3
3  E34000004       Swinefleet    4
4  E34000005         Foulsham    5

In [8]:
builtupAreas = builtupAreas.rename(columns={'BUA11NM': 'Name', 'BUA11CD': 'Code'})

In [10]:
del builtupAreas['FID']

In [16]:
##### Counties
counties = pd.read_csv('./location-data/counties.csv')

In [17]:
counties.head()

   CTY91CDC  CTY91CDO  CTY91CD             CTY91NM  ObjectId
0       1.0       NaN      NaN        Inner London         1
1       2.0       NaN      NaN        Outer London         2
2       NaN       1.0      0.0      Greater London         3
3       3.0       2.0      0.0  Greater Manchester         4
4       4.0       3.0      0.0          Merseyside         5

In [24]:
counties = counties.rename(columns={'CTY91NM': 'Name'})
counties['Code'] = None

Index(['CTY91CDO', 'CTY91CD', 'Name', 'ObjectId', 'Code'], dtype='object')

In [25]:
counties = counties.drop(['CTY91CDO', 'CTY91CD', 'ObjectId'], axis=1)

In [26]:
####

                 Name  Code
0        Inner London  None
1        Outer London  None
2      Greater London  None
3  Greater Manchester  None
4          Merseyside  None

In [28]:
#### Electoral divisions
electoral = pd.read_csv('./location-data/electoral-divisions.csv', sep=';')

In [29]:
electoral.head()

     CED21CD                CED21NM
0  E58000050                  Abbey
1  E58000051  Alconbury & Kimbolton
2  E58000052                 Arbury
3  E58000053               Bar Hill
4  E58000054     Brampton & Buckden

In [30]:
electoral = electoral.rename(columns={'CED21NM': 'Name', 'CED21CD': 'Code'})

In [31]:
#### Local Authorities

        Code                   Name
0  E58000050                  Abbey
1  E58000051  Alconbury & Kimbolton
2  E58000052                 Arbury
3  E58000053               Bar Hill
4  E58000054     Brampton & Buckden

In [32]:
authorities = pd.read_csv('./location-data/local-authorities.csv', sep=',')

In [34]:
authorities.head()

Index(['OBJECTID', 'LAD21CD', 'LAD21NM', 'LAD21NMW', 'BNG_E', 'BNG_N', 'LONG',
       'LAT', 'Shape__Area', 'Shape__Length'],
      dtype='object')

In [35]:
authorities = authorities.drop(['OBJECTID','LAD21NMW', 'BNG_E', 'BNG_N', 'LONG',
       'LAT', 'Shape__Area', 'Shape__Length'], axis=1)

In [36]:
authorities = authorities.rename(columns={'LAD21NM': 'Name', 'LAD21CD': 'Code'})

In [37]:
authorities.head()

        Code                  Name
0  E06000001            Hartlepool
1  E06000002         Middlesbrough
2  E06000003  Redcar and Cleveland
3  E06000004      Stockton-on-Tees
4  E06000005            Darlington

In [38]:
##### Local Government

In [39]:
government = pd.read_csv('./location-data/local-government.csv', sep=',')

In [40]:
government.head()

   FID    LGD20CD                               LGD20NM
0    1  N09000001               Antrim and Newtownabbey
1    2  N09000002  Armagh City, Banbridge and Craigavon
2    3  N09000003                               Belfast
3    4  N09000004              Causeway Coast and Glens
4    5  N09000005               Derry City and Strabane

In [41]:
government = government.rename(columns={'LGD20NM': 'Name', 'LGD20CD': 'Code'})

In [42]:
government = government.drop(['FID'], axis=1)

In [43]:
government.head()

        Code                                  Name
0  N09000001               Antrim and Newtownabbey
1  N09000002  Armagh City, Banbridge and Craigavon
2  N09000003                               Belfast
3  N09000004              Causeway Coast and Glens
4  N09000005               Derry City and Strabane

In [44]:
#### Metropolitan Counties
metropolitan = pd.read_csv('./location-data/metropolitan.csv', sep=',')

In [45]:
metropolitan.head()

   FID   MCTY20CD            MCTY20NM
0    1  E11000001  Greater Manchester
1    2  E11000002          Merseyside
2    3  E11000003     South Yorkshire
3    4  E11000005       West Midlands
4    5  E11000006      West Yorkshire

In [46]:
metropolitan = metropolitan.rename(columns={'MCTY20NM': 'Name', 'MCTY20CD': 'Code'})

In [47]:
metropolitan = metropolitan.drop(['FID'], axis=1)

In [48]:
metropolitan.head()

        Code                Name
0  E11000001  Greater Manchester
1  E11000002          Merseyside
2  E11000003     South Yorkshire
3  E11000005       West Midlands
4  E11000006      West Yorkshire

In [49]:
### Non civil parish
nonCivilParish = pd.read_csv('./location-data/non-civil-parish.csv', sep=';')

In [50]:
nonCivilParish.head()

     NCP21CD               NCP21NM
0  E43000001            Hartlepool
1  E43000002         Middlesbrough
2  E43000003  Redcar and Cleveland
3  E43000004      Stockton-on-Tees
4  E43000006                Halton

In [51]:
nonCivilParish = nonCivilParish.rename(columns={'NCP21NM': 'Name', 'NCP21CD': 'Code'})

In [52]:
nonCivilParish.head()

        Code                  Name
0  E43000001            Hartlepool
1  E43000002         Middlesbrough
2  E43000003  Redcar and Cleveland
3  E43000004      Stockton-on-Tees
4  E43000006                Halton

In [57]:
### Parishes
parish = pd.read_csv('./location-data/parish.csv')

In [58]:
parish.head()

   FID    PAR20CD        PAR20NM PAR20NMW    LAD20CD     LAD20NM
0    1  E04000253       Brierton      NaN  E06000001  Hartlepool
1    2  E04000254        Claxton      NaN  E06000001  Hartlepool
2    3  E04000255  Dalton Piercy      NaN  E06000001  Hartlepool
3    4  E04000256         Elwick      NaN  E06000001  Hartlepool
4    5  E04000257       Greatham      NaN  E06000001  Hartlepool

In [59]:
parish = parish.drop(['PAR20NMW', 'LAD20CD', 'LAD20NM', 'FID'], axis=1)

In [60]:
parish = parish.rename(columns={'PAR20NM': 'Name', 'PAR20CD': 'Code'})

In [61]:
parish.head()

        Code           Name
0  E04000253       Brierton
1  E04000254        Claxton
2  E04000255  Dalton Piercy
3  E04000256         Elwick
4  E04000257       Greatham

In [62]:
#### Towns and cities
townsAndCities = pd.read_csv('./location-data/towns-and-cities.csv')

In [63]:
townsAndCities.head()

   FID  TCITY15CD    TCITY15NM
0    1  J01000001     Barnsley
1    2  J01000002     Basildon
2    3  J01000003  Basingstoke
3    4  J01000004         Bath
4    5  J01000005      Bedford

In [64]:
townsAndCities = townsAndCities.drop(['FID'], axis=1)

In [65]:
townsAndCities = townsAndCities.rename(columns={'TCITY15NM': 'Name', 'TCITY15CD': 'Code'})

In [66]:
townsAndCities.head()

        Code         Name
0  J01000001     Barnsley
1  J01000002     Basildon
2  J01000003  Basingstoke
3  J01000004         Bath
4  J01000005      Bedford

In [67]:
#### Wards
wards = pd.read_csv('./location-data/wards.csv')

In [68]:
wards.head()

      WD20CD         WD20NM  FID
0  E05000299     Queensbury    1
1  E05000300   Rayners Lane    2
2  E05000301      Roxbourne    3
3  E05000302         Roxeth    4
4  E05000303  Stanmore Park    5

In [69]:
wards = wards.drop(['FID'], axis=1)

In [70]:
wards = wards.rename(columns={'WD20NM': 'Name', 'WD20CD': 'Code'})

In [71]:
wards.head()

        Code           Name
0  E05000299     Queensbury
1  E05000300   Rayners Lane
2  E05000301      Roxbourne
3  E05000302         Roxeth
4  E05000303  Stanmore Park

In [72]:
areas = pd.concat([builtupAreas, counties, electoral, authorities, government, metropolitan, nonCivilParish, parish, townsAndCities, wards], ignore_index=True)

In [74]:
areas.shape

(28071, 2)

In [96]:
vacancies = pd.read_csv('vacancies.csv', sep='|')

vacancies['source_id'] = vacancies['source_id'].astype(int)

In [82]:
vacancies.head()

,id,id_x,job_title,source_id,job_sector,type,county,city,posted_by,publish_date,floor_wage,ceiling_wage,currency,job_description
0,0,1,Accounts Administrator. Ambitious IT Solutions...,26392152,part-time,"per annum, pro-rata",Castle Donington,Castle Donington,Signum Solutions Ltd,2015-01-19,"15,000","18,000",Â£,Signum Solutions Ltd is an ambitious IT Soluti...
1,1,2,Westside:- Branded High Fashion Retail Sales A...,26450070,part-time,"per hour, negotiable",London,London,Westside,2015-02-03,7.00,10.00,Â£,WESTSIDE LONDON We are a fashion retailer loca...
2,2,3,Reservations Sales Specialist,26340069,birmingham,per annum,Brierley Hill,Brierley Hill,IHG,2015-01-13,"15,838","16,233",Â£,"IHG, the world's most global hotel company, is..."
3,3,4,Marketing Assistant,26486503,birmingham,per annum,Birmingham,Birmingham,KSA Associates,2015-02-02,"18,000","20,000",Â£,We are a young and energetic Accountancy pract...
4,4,5,Store Manager,26477487,ireland,per annum,Ireland,Ireland,Reed,2015-02-03,"50,000","55,000",â¬,Job Description Highly experienced Store Manag...

In [84]:
vacancies = vacancies.drop(['id', 'id_x'], axis=1)

IndexError: list index out of range

In [91]:
import difflib 

def fuzzy_merge(df1, df2, left_on, right_on, how='inner', cutoff=0.6):
    df_other= df2.copy()
    df_other[left_on] = [get_closest_match(x, df1[left_on], cutoff) 
                         for x in df_other[right_on]]
    return df1.merge(df_other, on=left_on, how=how)

def get_closest_match(x, other, cutoff):
    matches = difflib.get_close_matches(x, other, cutoff=cutoff)
    return matches[0] if matches else None

In [93]:
merged = fuzzy_merge(vacancies, areas, left_on='Name', right_on='Name')

In [94]:
merged.shape

(7409467, 13)

In [95]:
merged.head()

,job_title,source_id,job_sector,type,Name,city,posted_by,publish_date,floor_wage,ceiling_wage,currency,job_description,Code
0,Accounts Administrator. Ambitious IT Solutions...,26392152,part-time,"per annum, pro-rata",Castle Donington,Castle Donington,Signum Solutions Ltd,2015-01-19,"15,000","18,000",Â£,Signum Solutions Ltd is an ambitious IT Soluti...,E34001701
1,Accounts Administrator. Ambitious IT Solutions...,26392152,part-time,"per annum, pro-rata",Castle Donington,Castle Donington,Signum Solutions Ltd,2015-01-19,"15,000","18,000",Â£,Signum Solutions Ltd is an ambitious IT Soluti...,E34004358
2,Accounts Administrator. Ambitious IT Solutions...,26392152,part-time,"per annum, pro-rata",Castle Donington,Castle Donington,Signum Solutions Ltd,2015-01-19,"15,000","18,000",Â£,Signum Solutions Ltd is an ambitious IT Soluti...,E58000842
3,Accounts Administrator. Ambitious IT Solutions...,26392152,part-time,"per annum, pro-rata",Castle Donington,Castle Donington,Signum Solutions Ltd,2015-01-19,"15,000","18,000",Â£,Signum Solutions Ltd is an ambitious IT Soluti...,E07000069
4,Accounts Administrator. Ambitious IT Solutions...,26392152,part-time,"per annum, pro-rata",Castle Donington,Castle Donington,Signum Solutions Ltd,2015-01-19,"15,000","18,000",Â£,Signum Solutions Ltd is an ambitious IT Soluti...,E43000061

In [6]:
import os
import glob
import pandas as pd
os.chdir("/Users/selcen/Dropbox/Mac/Documents/uk-labor/labor-data/parts")

extension = 'csv'
all_filenames = [i for i in glob.glob('*.{}'.format(extension))]

#combine all files in the list
combined_csv = pd.concat([pd.read_csv(f, sep='|') for f in all_filenames ])
#export to csv
os.chdir("/Users/selcen/Dropbox/Mac/Documents/uk-labor/labor-data")
combined_csv.to_csv( "combined_csv.csv", sep='|', index=False, encoding='utf-8-sig')